/*
 * Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден
 * негативен број или 0 треба да се печати „Invalid input“.
 * Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
 * Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се
 * наоѓаат на парните позиции од другиот број, во истиот редослед.
 * Соодветно да се испечатат пораки „PAREN“ и „NE“.
 * Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)*/

#include <stdio.h>

int main() {
    int a, b;
    scanf("%d", &a);
    scanf("%d", &b);

    if(a <= 0 || b <= 0) {
        printf("Invalid input");
        return 0;
    }

    if(a > b) {
        while(b) { // 1234 13
            if(a%100/10 != b%10) {
                printf("NE");
                return 0;
            }
            a /= 100;
            b /= 10;
        }
        printf("PAREN");

    } else {
        while(a) { // 13 1234
            if(b%100/10 != a%10) {
                printf("NE");
                return 0;
            }
            b /= 100;
            a /= 10;
        }
        printf("PAREN");
    }

    return 0;
}


